using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class SwordAndScabbardInteractionSystem : MonoBehaviour
{
    /// <summary>
    /// from 0 to 1
    /// </summary>
    public float SwordEnteringScabbardProgress;

    ///Когда кончик меча оказывается близко к ножнам(10 см), его начинает подтягивать к дырке входа.
    ///Когда он касается дырки входа, состояние меча переходит на "входит в ножны"
    ///ConfigurableJoint привязывается к кончику меча и позволяет ему менять position только в по лини заданной(в идеале даже по изогнутой, но пока что на стадии: "только по Y")
    ///И ограничивает ему угол поворота. Начальное ограничение очень маленькое, но чем глубже меч продвигается по линии, тем меньше ему разрешается держать угол наклона.
    ///Лист углов наклона - это ключевые кадры. Между ними значения интерполируются, каждый раз проверяя прогресс между ключевыми кадрами.
}
